In [1]:

import pandas as pd
dataframe = pd.read_csv('./db1.csv', sep=',')
dataframe.head()

,Series_reference,Period,Data_value,Suppressed,STATUS,UNITS,Magnitude,Subject,Group,Series_title_1,Series_title_2,Series_title_3,Series_title_4,Series_title_5
0,BDCQ.SEA1AA,2011.06,80078.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN
1,BDCQ.SEA1AA,2011.09,78324.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN
2,BDCQ.SEA1AA,2011.12,85850.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN
3,BDCQ.SEA1AA,2012.03,90743.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN
4,BDCQ.SEA1AA,2012.06,81780.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN

In [2]:
import numpy as np
from scipy import stats as st

import matplotlib.pyplot as plt
from matplotlib.font_manager import FontProperties
import seaborn as sns

/usr/lib/python3/dist-packages/scipy/__init__.py:146: UserWarning: A NumPy version >=1.17.3 and <1.25.0 is required for this version of SciPy (detected version 1.26.4
  warnings.warn(f"A NumPy version >={np_minversion} and <{np_maxversion}"

In [3]:
import ydata_profiling

In [4]:
dataframe.drop(['Data_value'], axis=1, inplace=True) # unimportant variables

In [5]:
dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22963 entries, 0 to 22962
Data columns (total 13 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Series_reference  22963 non-null  object
 1   Period            22963 non-null  float64
 2   Suppressed        2839 non-null   object
 3   STATUS            22963 non-null  object
 4   UNITS             22963 non-null  object
 5   Magnitude         22963 non-null  int64
 6   Subject           22963 non-null  object
 7   Group             22963 non-null  object
 8   Series_title_1    22963 non-null  object
 9   Series_title_2    22963 non-null  object
 10  Series_title_3    22963 non-null  object
 11  Series_title_4    0 non-null      float64
 12  Series_title_5    0 non-null      float64
dtypes: float64(3), int64(1), object(9)
memory usage: 2.3+ MB

In [6]:
dataframe = dataframe.rename(columns={"Schizophrenia disorders (share of population) - Sex: Both - Age: Age-standardized": "Schizophrenia disorders"})
dataframe = dataframe.rename(columns={"Depressive disorders (share of population) - Sex: Both - Age: Age-standardized": "Depressive disorders"})
dataframe = dataframe.rename(columns={"Anxiety disorders (share of population) - Sex: Both - Age: Age-standardized": "Anxiety disorders"})
dataframe = dataframe.rename(columns={"Bipolar disorders (share of population) - Sex: Both - Age: Age-standardized": "Bipolar disorders"})
dataframe = dataframe.rename(columns={"Eating disorders (share of population) - Sex: Both - Age: Age-standardized": "Eating disorders"})

In [7]:
dataframe.describe()

             Period     Magnitude  Series_title_4  Series_title_5
count  22963.000000  22963.000000             0.0             0.0
mean    2017.121172      2.310064             NaN             NaN
std        3.699584      2.919651             NaN             NaN
min     2011.060000      0.000000             NaN             NaN
25%     2014.060000      0.000000             NaN             NaN
50%     2017.060000      0.000000             NaN             NaN
75%     2020.090000      6.000000             NaN             NaN
max     2024.030000      6.000000             NaN             NaN

In [1]:

profile_report = ydata_profiling.ProfileReport(dataframe, progress_bar=False)
profile_report.to_html()

NameError: name 'ydata_profiling' is not defined

In [ ]:
var_info = profile_report.get_description()['messages'] # metadata from report